import { p as createVNode, F as Fragment, az as __astro_tag_component__ } from './astro/server_Dso1QYyF.mjs';
import { b as $$Aside } from './Code_WFUXKkih.mjs';
import './Icon_CK40Z_jw.mjs';
import 'clsx';

const frontmatter = {
  "title": "Website တစ်ခု မြန်ဖို့ ဘာလို့ အရေးကြီးတာလဲ?",
  "description": "Website တစ်ခု မြန်ဖို့ ဘာလို့ အရေးကြီးတာလဲ?"
};
function getHeadings() {
  return [{
    "depth": 2,
    "slug": "web-performance-ဆိုတာ-ဘာလဲ",
    "text": "Web Performance ဆိုတာ ဘာလဲ။"
  }, {
    "depth": 2,
    "slug": "website-ကြီးနှေးနေရင်-သုံးစွဲသူတွေ-ဘာဖြစ်လဲ",
    "text": "Website ကြီးနှေးနေရင် သုံးစွဲသူတွေ ဘာဖြစ်လဲ?"
  }, {
    "depth": 3,
    "slug": "လူတွေ-ထွက်သွားကြတယ်",
    "text": "လူတွေ ထွက်သွားကြတယ်။"
  }, {
    "depth": 3,
    "slug": "အာရုံ-စိုက်မှု-နည်းတယ်",
    "text": "အာရုံ စိုက်မှု နည်းတယ်။"
  }, {
    "depth": 2,
    "slug": "ဘာကြောင့်-website-တစ်ခုက-မြန်ဖို့-ဒီလောက်-အရေးကြီးတာလဲ",
    "text": "ဘာကြောင့် Website တစ်ခုက မြန်ဖို့ ဒီလောက် အရေးကြီးတာလဲ။"
  }, {
    "depth": 3,
    "slug": "1-သုံးစွဲသူ-ပျော်ရွှင်မှု-️",
    "text": "1. သုံးစွဲသူ ပျော်ရွှင်မှု ❤️"
  }, {
    "depth": 3,
    "slug": "2-ပိုက်ဆံ-ပိုရတယ်-ရောင်းအား-တက်တယ်",
    "text": "2. ပိုက်ဆံ ပိုရတယ်။ ရောင်းအား တက်တယ်။ 💰"
  }, {
    "depth": 3,
    "slug": "google-မှာ-ranking-ပိုကောင်းတယ်-seo-ကောင်းလာတယ်",
    "text": "Google မှာ Ranking ပိုကောင်းတယ်။ (SEO ကောင်းလာတယ်။) 📈"
  }, {
    "depth": 3,
    "slug": "လူတိုင်း-သုံးဖို့-ပိုအဆင်ပြေတယ်",
    "text": "လူတိုင်း သုံးဖို့ ပိုအဆင်ပြေတယ်။ ♿"
  }, {
    "depth": 3,
    "slug": "နာမည်ကောင်း-ရစေတယ်-ယုံကြည်မှု-တည်ဆောက်တယ်",
    "text": "နာမည်ကောင်း ရစေတယ်။ ယုံကြည်မှု တည်ဆောက်တယ်။ ✨"
  }, {
    "depth": 3,
    "slug": "ဖုန်း-နဲ့-သုံးလို့-ရဖို့-အရေးကြီးတယ်",
    "text": "ဖုန်း နဲ့ သုံးလို့ ရဖို့ အရေးကြီးတယ်။ 📱"
  }];
}
function _createMdxContent(props) {
  const {Fragment: Fragment$1} = props.components || ({});
  if (!Fragment$1) _missingMdxReference("Fragment");
  return createVNode(Fragment, {
    children: [createVNode($$Aside, {
      title: "ရည်ရွယ်ချက်",
      "set:html": "<p><strong>Website performance</strong> ဆိုတာ သုံးစွဲသူတွေ ပျော်ရွှင်ဖို့၊ စီးပွားရေးများ အောင်မြင်ဖို့နဲ့ website ရေးတဲ့သူတစ်ယောက်အနေနဲ့ ဘယ်လောက် အရေးကြီးလဲဆိုတာ သိရဖို့ပါ။</p>"
    }), "\n", createVNode(Fragment$1, {
      "set:html": "<div class=\"sl-heading-wrapper level-h2\"><h2 id=\"web-performance-ဆိုတာ-ဘာလဲ\">Web Performance ဆိုတာ ဘာလဲ။</h2><a class=\"sl-anchor-link\" href=\"#web-performance-ဆိုတာ-ဘာလဲ\"><span aria-hidden=\"true\" class=\"sl-anchor-icon\"><svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg></span><span class=\"sr-only\">Section titled “Web Performance ဆိုတာ ဘာလဲ။”</span></a></div>\n<p>Web Performance ဆိုတာ Website တစ်ခုလုံး အလုပ်လုပ်ပုံ ဘယ်လောက် ကောင်းလဲ ဆိုတာကို ပြောတာပါ။ Page တစ်ခု တက်လာတာ မြန်ရုံတင် မဟုတ်ပါဘူး။</p>\n<ul>\n<li>သုံးစွဲသူတွေ ဘယ်လောက် မြန်မြန် မြင်ရလဲ။</li>\n<li>Page တစ်ခုက ဘယ်လောက် မြန်မြန် <strong>interactive</strong> ဖြစ်လဲ (ဥပမာ- ခလုတ်နှိပ်တာ၊ scroll ဆွဲတာ)။</li>\n<li>loading ဖြစ်နေတုန်း စာတွေ၊ ပုံတွေ ရွေ့သွားပြီး စိတ်မရှည်စရာ ဖြစ်မဖြစ် စတာတွေကို ပြောတာပါ။</li>\n</ul>\n<blockquote>\n<p>ဒါက သုံးရတာ ချောချောမွေ့မွေ့ ဖြစ်စေတဲ့ website နဲ့၊ သုံးရတာ နှေးကွေးပြီး စိတ်ရှုပ်စရာ ကောင်းတဲ့ website တို့ရဲ့ ကွာခြားချက်ပါပဲ။</p>\n</blockquote>\n<p><strong>ဥပမာ။</strong> Online Store Websites နှစ်ခုကို စဉ်းစားကြည့်ပါ။</p>\n<ul>\n<li>ဆိုဒ် (A) က ချက်ချင်းတက်တယ်။ ပုံတွေ ပေါ်တယ်။ ပစ္စည်းတွေကို ချက်ချင်းနှိပ်ပြီး ကြည့်လို့ရတယ်။</li>\n<li>ဆိုဒ် (B) ကတော့ အကြာကြီး နေမှ တတ်တယ်။ ပြီးမှ “ဝယ်ရန်” ခလုတ် ပေါ်လာတယ်။ အဲဒီခလုတ်ကို နှိပ်တော့လည်း နည်းနည်းကြာသည်အထိ ဘာမှ မဖြစ်ဘူး။</li>\n</ul>\n<blockquote>\n<p>ဘယ်ဆိုင်ကနေ ပစ္စည်းဝယ်ဖို့ ပိုများမလဲ။ Users တွေ<strong>ခံစားရတဲ့ Feeling</strong> က အရမ်းအရေးကြီးပါတယ်။</p>\n</blockquote>\n<div class=\"sl-heading-wrapper level-h2\"><h2 id=\"website-ကြီးနှေးနေရင်-သုံးစွဲသူတွေ-ဘာဖြစ်လဲ\">Website ကြီးနှေးနေရင် သုံးစွဲသူတွေ ဘာဖြစ်လဲ?</h2><a class=\"sl-anchor-link\" href=\"#website-ကြီးနှေးနေရင်-သုံးစွဲသူတွေ-ဘာဖြစ်လဲ\"><span aria-hidden=\"true\" class=\"sl-anchor-icon\"><svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg></span><span class=\"sr-only\">Section titled “Website ကြီးနှေးနေရင် သုံးစွဲသူတွေ ဘာဖြစ်လဲ?”</span></a></div>\n<p>အွန်လိုင်းမှာ ကျွန်တော်တို့အားလုံးက <strong>စိတ်မရှည်</strong> ကြပါဘူး။ အချက်အလက်တွေကို <strong>ချက်ချင်း</strong> လိုချင်ကြတယ်။ Website က ကြာနေရင် နောက်တစ်ခုကို ပြောင်းချင်စိတ် ဖြစ်လာပါတယ်။</p>\n<ul>\n<li>\n<div class=\"sl-heading-wrapper level-h3\"><h3 id=\"လူတွေ-ထွက်သွားကြတယ်\">လူတွေ ထွက်သွားကြတယ်။</h3><a class=\"sl-anchor-link\" href=\"#လူတွေ-ထွက်သွားကြတယ်\"><span aria-hidden=\"true\" class=\"sl-anchor-icon\"><svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg></span><span class=\"sr-only\">Section titled “လူတွေ ထွက်သွားကြတယ်။”</span></a></div>\n<p>Link တစ်ခုကို နှိပ်ပြီး မျက်နှာပြင် ဗလာကြီးကို ခဏတာ စိုက်ကြည့်ဖူးလား။ ပြီးတော့ စိတ်ပျက်ပြီး ထွက်သွားဖူးလား။ ဒါကို <strong>Bounce</strong> လို့ ခေါ်ပါတယ်။ Website နှေးတာကြောင့် သုံးစွဲသူ ဆုံးရှုံးသွားတာပါ။</p>\n<ul>\n<li>လေ့လာမှုတွေအရ၊ စာမျက်နှာ တက်ဖို့ တစ်စက္ကန့် ပိုကြာတိုင်း၊ လူတွေ ပိုပိုပြီး ထွက်သွားကြပါတယ်။ သူတို့ ထိုင်မစောင့်ကြပါဘူး။</li>\n</ul>\n</li>\n<li>\n<div class=\"sl-heading-wrapper level-h3\"><h3 id=\"အာရုံ-စိုက်မှု-နည်းတယ်\">အာရုံ စိုက်မှု နည်းတယ်။</h3><a class=\"sl-anchor-link\" href=\"#အာရုံ-စိုက်မှု-နည်းတယ်\"><span aria-hidden=\"true\" class=\"sl-anchor-icon\"><svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg></span><span class=\"sr-only\">Section titled “အာရုံ စိုက်မှု နည်းတယ်။”</span></a></div>\n</li>\n</ul>\n<p>အွန်လိုင်းမှာ ကျွန်တော်တို့က တစ်နေရာကနေ တစ်နေရာကို အမြန်ပြောင်းလဲကြပါတယ်။ သင့်ဆိုဒ်က မြန်မြန်မတက်ဘူး၊ ချက်ချင်း ဆွဲဆောင်မှုမပေးနိုင်ဘူးဆိုရင် သူတို့က တခြား Website ကို ထွက်သွားကြမှာပါ။</p>\n<div class=\"sl-heading-wrapper level-h2\"><h2 id=\"ဘာကြောင့်-website-တစ်ခုက-မြန်ဖို့-ဒီလောက်-အရေးကြီးတာလဲ\">ဘာကြောင့် Website တစ်ခုက မြန်ဖို့ ဒီလောက် အရေးကြီးတာလဲ။</h2><a class=\"sl-anchor-link\" href=\"#ဘာကြောင့်-website-တစ်ခုက-မြန်ဖို့-ဒီလောက်-အရေးကြီးတာလဲ\"><span aria-hidden=\"true\" class=\"sl-anchor-icon\"><svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg></span><span class=\"sr-only\">Section titled “ဘာကြောင့် Website တစ်ခုက မြန်ဖို့ ဒီလောက် အရေးကြီးတာလဲ။”</span></a></div>\n<p>Website က နှေးနေရင် Users တွေ ဆုံးရှုံးရုံတင် မဟုတ်ပါဘူး။ တကယ်တော့ အများကြီး ဆုံးရှုံးနိုင်ပါတယ်။</p>\n<div class=\"sl-heading-wrapper level-h3\"><h3 id=\"1-သုံးစွဲသူ-ပျော်ရွှင်မှု-️\">1. သုံးစွဲသူ ပျော်ရွှင်မှု ❤️</h3><a class=\"sl-anchor-link\" href=\"#1-သုံးစွဲသူ-ပျော်ရွှင်မှု-️\"><span aria-hidden=\"true\" class=\"sl-anchor-icon\"><svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg></span><span class=\"sr-only\">Section titled “1. သုံးစွဲသူ ပျော်ရွှင်မှု ❤️”</span></a></div>\n<p>မြန်တဲ့ Websites တွေက သုံးစွဲသူတွေကို ပျော်ရွှင်စေတယ်။ သူတို့က အချိန်ကုန်သက်သာပြီး အလုပ်မြန်မြန် ပြီးတယ်လို့ ခံစားရတယ်။ သုံးစွဲသူတွေ ပျော်ရွှင်ရင် ဆိုဒ်မှာ ကြာကြာနေမယ်၊ နောက်ထပ် ထပ်လာကြမယ်။</p>\n<div class=\"sl-heading-wrapper level-h3\"><h3 id=\"2-ပိုက်ဆံ-ပိုရတယ်-ရောင်းအား-တက်တယ်\">2. ပိုက်ဆံ ပိုရတယ်။ ရောင်းအား တက်တယ်။ 💰</h3><a class=\"sl-anchor-link\" href=\"#2-ပိုက်ဆံ-ပိုရတယ်-ရောင်းအား-တက်တယ်\"><span aria-hidden=\"true\" class=\"sl-anchor-icon\"><svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg></span><span class=\"sr-only\">Section titled “2. ပိုက်ဆံ ပိုရတယ်။ ရောင်းအား တက်တယ်။ 💰”</span></a></div>\n<p>ပစ္စည်းရောင်းတဲ့ လုပ်ငန်းတွေအတွက် ဒါက အရမ်းအရေးကြီးတယ်။ Page မြန်မြန် တက်လေ၊ ရောင်းအား ပိုတက်လေ ပါပဲ။ သင် Register လုပ်ခိုင်းတာပဲ ဖြစ်ဖြစ်၊ ပစ္စည်းဝယ်တာပဲ ဖြစ်ဖြစ်၊ မြန်လေ ပိုပြီး ကောင်းလေပါပဲ။</p>\n<div class=\"sl-heading-wrapper level-h3\"><h3 id=\"google-မှာ-ranking-ပိုကောင်းတယ်-seo-ကောင်းလာတယ်\">Google မှာ Ranking ပိုကောင်းတယ်။ (SEO ကောင်းလာတယ်။) 📈</h3><a class=\"sl-anchor-link\" href=\"#google-မှာ-ranking-ပိုကောင်းတယ်-seo-ကောင်းလာတယ်\"><span aria-hidden=\"true\" class=\"sl-anchor-icon\"><svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg></span><span class=\"sr-only\">Section titled “Google မှာ Ranking ပိုကောင်းတယ်။ (SEO ကောင်းလာတယ်။) 📈”</span></a></div>\n<p>Google က သူ့သုံးစွဲသူတွေကို အကောင်းဆုံး ဆိုဒ်တွေပဲ ပြချင်တယ်။ မြန်တဲ့ဆိုဒ်တွေက Google မှာ ပိုပေါ်နိုင်တယ်။ ဒါကြောင့် Google က “ဆိုဒ် မြန်နှုန်း” (Site Speed) နဲ့ “Core Web Vitals” ဆိုတာတွေကို အရေးကြီးတဲ့ အချက်တွေအဖြစ် သတ်မှတ်ထားတယ်။</p>\n<blockquote>\n<p>ဆိုဒ်မြန်လေ = Google မှာ search result ပိုမြင့်လေ = လူတွေ သင့်ဆိုဒ်ကို ပိုလာလေပါပဲ။</p>\n</blockquote>\n<div class=\"sl-heading-wrapper level-h3\"><h3 id=\"လူတိုင်း-သုံးဖို့-ပိုအဆင်ပြေတယ်\">လူတိုင်း သုံးဖို့ ပိုအဆင်ပြေတယ်။ ♿</h3><a class=\"sl-anchor-link\" href=\"#လူတိုင်း-သုံးဖို့-ပိုအဆင်ပြေတယ်\"><span aria-hidden=\"true\" class=\"sl-anchor-icon\"><svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg></span><span class=\"sr-only\">Section titled “လူတိုင်း သုံးဖို့ ပိုအဆင်ပြေတယ်။ ♿”</span></a></div>\n<p>ဒါက အရမ်းအရေးကြီးတယ်။ ဖုန်းအဟောင်းတွေ၊ အင်တာနက် နှေးတဲ့သူတွေအတွက် နှေးတဲ့ website တွေက သုံးရတာ ပိုခက်ခဲတယ်။ သင့်ဆိုဒ်ကို မြန်မြန်ဆန်ဆန်နဲ့ ပေါ့ပေါ့ပါးပါး ဖြစ်အောင် လုပ်ခြင်းက လူတိုင်းအတွက် ပိုပြီး သုံးလို့ကောင်းအောင် လုပ်ပေးတာပါပဲ။</p>\n<div class=\"sl-heading-wrapper level-h3\"><h3 id=\"နာမည်ကောင်း-ရစေတယ်-ယုံကြည်မှု-တည်ဆောက်တယ်\">နာမည်ကောင်း ရစေတယ်။ ယုံကြည်မှု တည်ဆောက်တယ်။ ✨</h3><a class=\"sl-anchor-link\" href=\"#နာမည်ကောင်း-ရစေတယ်-ယုံကြည်မှု-တည်ဆောက်တယ်\"><span aria-hidden=\"true\" class=\"sl-anchor-icon\"><svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg></span><span class=\"sr-only\">Section titled “နာမည်ကောင်း ရစေတယ်။ ယုံကြည်မှု တည်ဆောက်တယ်။ ✨”</span></a></div>\n<p>သင့် Website ဟာ သင့်လုပ်ငန်းရဲ့ ပထမဆုံး မြင်ရတဲ့ နေရာ ဖြစ်နေတတ်တယ်။ နှေးတဲ့ဆိုဒ်က “ဒီလူတွေက သိပ် Professional မဆန်ဘူး” ဒါမှမဟုတ် “ယုံလို့မရဘူး” လို့ ထင်စေနိုင်တယ်။ မြန်ပြီး သပ်ရပ်တဲ့ ဆိုဒ်တစ်ခုက “ကျွန်တော်တို့က ကိုယ့်အလုပ်ကို ဂရုစိုက်တယ်၊ ယုံကြည်လို့ရတယ်” လို့ ပြောပြနေသလိုပါပဲ။</p>\n<div class=\"sl-heading-wrapper level-h3\"><h3 id=\"ဖုန်း-နဲ့-သုံးလို့-ရဖို့-အရေးကြီးတယ်\">ဖုန်း နဲ့ သုံးလို့ ရဖို့ အရေးကြီးတယ်။ 📱</h3><a class=\"sl-anchor-link\" href=\"#ဖုန်း-နဲ့-သုံးလို့-ရဖို့-အရေးကြီးတယ်\"><span aria-hidden=\"true\" class=\"sl-anchor-icon\"><svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg></span><span class=\"sr-only\">Section titled “ဖုန်း နဲ့ သုံးလို့ ရဖို့ အရေးကြီးတယ်။ 📱”</span></a></div>\n<p>အခုဆို Website သုံးတဲ့သူ အများစုက ဖုန်းနဲ့ သုံးကြတယ်။ Google ကလည်း <strong>“mobile-first indexing”</strong> လို့ခေါ်တဲ့၊ မိုဘိုင်းဆိုဒ်ရဲ့ စွမ်းဆောင်ရည်ကို ပိုအလေးထားတဲ့ စနစ်ကို သုံးတယ်။ မိုဘိုင်းဖုန်းတွေက desktop တွေထက် စွမ်းဆောင်နိုင်စွမ်းနည်းပြီး အင်တာနက်လည်း သိပ်မကောင်းတတ်ဘူး။ ဒါကြောင့် သင့်ဆိုဒ်ကို မိုဘိုင်းဖုန်းနဲ့ မြန်အောင် မလုပ်ထားဘူးဆိုရင်၊ လူတွေ အများကြီးကို ဆုံးရှုံးနိုင်ပါတယ်။</p>\n<blockquote>\n<p>အခုဆို Website မြန်ဖို့ ဘယ်လောက်အရေးကြီးလဲဆိုတာ ခံစားမိပြီလား။ ဒီ Course မှာ ကျွန်တော်တို့က ဒီပြဿနာတွေကို ဘယ်လို ဖြေရှင်းရမလဲ ဆိုတာ သင်ယူကြမှာပါ။ Website Performance ပိုင်းမှာ ဘယ်နေရာတွေ အားနည်းလဲ ရှာမယ်၊ ဘယ်လို အကောင်းဆုံး လုပ်မလဲ၊ သင့် Websites တွေကို ဘယ်လို အံ့မခန်း မြန်ပြီး သုံးရတာ ကောင်းအောင် လုပ်မလဲဆိုတာ သင်ယူကြပါမယ်။</p>\n</blockquote>\n"
    }), createVNode($$Aside, {
      title: "အနှစ်ချုပ်",
      "set:html": "<p>ပြောရရင် Website မြန်ဆန်ခြင်းက အရမ်းကို အရေးကြီးပါတယ်။ ဒါဟာ သုံးစွဲသူတွေကို ပျော်ရွှင်စေတာ၊ လုပ်ငန်း အောင်မြင်စေတာ၊ လူသိများစေတာနဲ့ လူတိုင်းအတွက် ပိုကောင်းအောင် လုပ်ဆောင်ခြင်းပါပဲ။ ဒါဟာ အဓိက အကျဆုံး လုပ်ဆောင်ချက် ပါပဲ!</p>"
    })]
  });
}
function MDXContent(props = {}) {
  const {wrapper: MDXLayout} = props.components || ({});
  return MDXLayout ? createVNode(MDXLayout, {
    ...props,
    children: createVNode(_createMdxContent, {
      ...props
    })
  }) : _createMdxContent(props);
}
function _missingMdxReference(id, component) {
  throw new Error("Expected " + ("component" ) + " `" + id + "` to be defined: you likely forgot to import, pass, or provide it.");
}

const url = "src/content/docs/web-performance/introduction/why-web-performance.mdx";
const file = "/Users/waiyanphyoaung/code/waiyanphyoaung/src/content/docs/web-performance/introduction/why-web-performance.mdx";
const Content = (props = {}) => MDXContent({
  ...props,
  components: { Fragment: Fragment, ...props.components, },
});
Content[Symbol.for('mdx-component')] = true;
Content[Symbol.for('astro.needsHeadRendering')] = !Boolean(frontmatter.layout);
Content.moduleId = "/Users/waiyanphyoaung/code/waiyanphyoaung/src/content/docs/web-performance/introduction/why-web-performance.mdx";
__astro_tag_component__(Content, 'astro:jsx');

export { Content, Content as default, file, frontmatter, getHeadings, url };
